bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90PWM1.xml
            <value-group caption="" name="ENUM_BOOTSZ">
                <value caption="Boot Flash size=128 words Boot address=$0F80" name="128W_0F80" value="0x03"/>
                <value caption="Boot Flash size=256 words Boot address=$0F00" name="256W_0F00" value="0x02"/>
                <value caption="Boot Flash size=512 words Boot address=$0E00" name="512W_0E00" value="0x01"/>
                <value caption="Boot Flash size=1024 words Boot address=$0C00" name="1024W_0C00" value="0x00"/>
            </value-group>
        </module>
        <module caption="Lockbits" name="LOCKBIT">
            <register-group caption="Lockbits" name="LOCKBIT">
                <register caption="" name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x0C" name="BLB0" values="ENUM_BLB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x30" name="BLB1" values="ENUM_BLB2"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_LB">
                <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
                <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
                <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB">
                <value caption="LPM and SPM prohibited in Application Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Application Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Application Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Application Section" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB2">
                <value caption="LPM and SPM prohibited in Boot Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Boot Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Boot Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Boot Section" name="NO_LOCK" value="0x03"/>
            </value-group>
        </module>
        <module caption="I/O Port" name="PORT">
            <register-group caption="I/O Port" name="PORTB">
                <register caption="Port B Data Register" name="PORTB" offset="0x25" size="1" mask="0xFF"/>
                <register caption="Port B Data Direction Register" name="DDRB" offset="0x24" size="1" mask="0xFF"/>
                <register caption="Port B Input Pins" name="PINB" offset="0x23" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTD">
                <register caption="Port D Data Register" name="PORTD" offset="0x2B" size="1" mask="0xFF"/>
                <register caption="Port D Data Direction Register" name="DDRD" offset="0x2A" size="1" mask="0xFF"/>
                <register caption="Port D Input Pins" name="PIND" offset="0x29" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTE">
                <register caption="Port E Data Register" name="PORTE" offset="0x2E" size="1" mask="0x07"/>
                <register caption="Port E Data Direction Register" name="DDRE" offset="0x2D" size="1" mask="0x07"/>
                <register caption="Port E Input Pins" name="PINE" offset="0x2C" size="1" mask="0x07" ocd-rw="R"/>
            </register-group>
        </module>
        <module caption="Bootloader" name="BOOT_LOAD">
            <register-group caption="Bootloader" name="BOOT_LOAD">
                <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
                    <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
                    <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
                    <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
                    <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
        </module>
        <module caption="Power Stage Controller" name="PSC">
            <register-group caption="Power Stage Controller" name="PSC0">
                <register caption="PSC 0 Input Capture Register" name="PICR0" offset="0xDE" size="2">
                    <bitfield caption="PSC 0 Capture Software Trig bit" mask="0x8000" name="PCST0"/>
                    <bitfield caption="PSC 0 Capture Register" mask="0x0FFF" name="PICR0"/>
                </register>
                <register caption="PSC 0 Input B Control" name="PFRC0B" offset="0xDD" size="1">
                    <bitfield caption="PSC 0 Capture Enable Input Part B" mask="0x80" name="PCAE0B"/>
                    <bitfield caption="PSC 0 Input Select for Part B" mask="0x40" name="PISEL0B"/>
                    <bitfield caption="PSC 0 Edge Level Selector on Input Part B" mask="0x20" name="PELEV0B"/>
                    <bitfield caption="PSC 0 Filter Enable on Input Part B" mask="0x10" name="PFLTE0B"/>
                    <bitfield caption="PSC 0 Retrigger and Fault Mode for Part B" mask="0x0F" name="PRFM0B"
                              values="PSC_FAULT_MODE_OPER"/>
                </register>
                <register caption="PSC 0 Input A Control" name="PFRC0A" offset="0xDC" size="1">
                    <bitfield caption="PSC 0 Capture Enable Input Part A" mask="0x80" name="PCAE0A"/>
                    <bitfield caption="PSC 0 Input Select for Part A" mask="0x40" name="PISEL0A"/>
                    <bitfield caption="PSC 0 Edge Level Selector on Input Part A" mask="0x20" name="PELEV0A"/>
                    <bitfield caption="PSC 0 Filter Enable on Input Part A" mask="0x10" name="PFLTE0A"/>
                    <bitfield caption="PSC 0 Retrigger and Fault Mode for Part A" mask="0x0F" name="PRFM0A"
                              values="PSC_FAULT_MODE_OPER"/>
                </register>
                <register caption="PSC 0 Control Register" name="PCTL0" offset="0xDB" size="1">
                    <bitfield caption="PSC 0 Prescaler Selects" mask="0xC0" name="PPRE0" values="PSC_PRESCALER"/>
                    <bitfield caption="PSC 0 Balance Flank Width Modulation" mask="0x20" name="PBFM0"/>
                    <bitfield caption="PSC 0 Asynchronous Output Control B" mask="0x10" name="PAOC0B"/>
                    <bitfield caption="PSC 0 Asynchronous Output Control A" mask="0x08" name="PAOC0A"/>
                    <bitfield caption="PSC0 Auto Run" mask="0x04" name="PARUN0"/>
                    <bitfield caption="PSC0 Complete Cycle" mask="0x02" name="PCCYC0"/>
                    <bitfield caption="PSC 0 Run" mask="0x01" name="PRUN0"/>
                </register>
                <register caption="PSC 0 Configuration Register" name="PCNF0" offset="0xDA" size="1">
                    <bitfield caption="PSC 0 Fifty" mask="0x80" name="PFIFTY0"/>
                    <bitfield caption="PSC 0 Autolock" mask="0x40" name="PALOCK0"/>
                    <bitfield caption="PSC 0 Lock" mask="0x20" name="PLOCK0"/>
                    <bitfield caption="PSC 0 Mode" mask="0x18" name="PMODE0" values="PSC_ALIGN_MODE"/>
                    <bitfield caption="PSC 0 Output Polarity" mask="0x04" name="POP0"/>
                    <bitfield caption="PSC 0 Input Clock Select" mask="0x02" name="PCLKSEL0"/>
                </register>
