bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90PWM1.xml
                <register caption="Output Compare RB Register " name="OCR0RB" offset="0xD8" size="2" mask="0xFFFF"/>
                <register caption="Output Compare SB Register " name="OCR0SB" offset="0xD6" size="2" mask="0x0FFF"/>
                <register caption="Output Compare RA Register " name="OCR0RA" offset="0xD4" size="2" mask="0x0FFF"/>
                <register caption="Output Compare SA Register " name="OCR0SA" offset="0xD2" size="2" mask="0x0FFF"/>
                <register caption="PSC0 Synchro and Output Configuration" name="PSOC0" offset="0xD0" size="1">
                    <bitfield caption="Synchronization Out for ADC Selection" mask="0x30" name="PSYNC0"
                              values="PSC_SYNC_SOURCE"/>
                    <bitfield caption="PSCOUT01 Output Enable" mask="0x04" name="POEN0B"/>
                    <bitfield caption="PSCOUT00 Output Enable" mask="0x01" name="POEN0A"/>
                </register>
                <register caption="PSC0 Interrupt Mask Register" name="PIM0" offset="0xA1" size="1">
                    <bitfield caption="PSC 0 Synchro Error Interrupt Enable" mask="0x20" name="PSEIE0"/>
                    <bitfield caption="External Event B Interrupt Enable" mask="0x10" name="PEVE0B"/>
                    <bitfield caption="External Event A Interrupt Enable" mask="0x08" name="PEVE0A"/>
                    <bitfield caption="End of Cycle Interrupt Enable" mask="0x01" name="PEOPE0"/>
                </register>
                <register caption="PSC0 Interrupt Flag Register" name="PIFR0" offset="0xA0" size="1">
                    <bitfield caption="PSC 0 Synchro Error Interrupt" mask="0x20" name="PSEI0"/>
                    <bitfield caption="External Event B Interrupt" mask="0x10" name="PEV0B"/>
                    <bitfield caption="External Event A Interrupt" mask="0x08" name="PEV0A"/>
                    <bitfield caption="Ramp Number" mask="0x06" name="PRN0" values="MISC_2BIT_COUNT"/>
                    <bitfield caption="End of PSC0 Interrupt" mask="0x01" name="PEOP0"/>
                </register>
            </register-group>
            <register-group caption="Power Stage Controller" name="PSC2">
                <register caption="PSC 2 Input Capture Register " name="PICR2" offset="0xFE" size="2">
                    <bitfield caption="PSC 2 Capture Software Trig bit" mask="0x8000" name="PCST2"/>
                    <bitfield caption="PSC 2 Input Capture Register" mask="0x0FFF" name="PICR2"/>
                </register>
                <register caption="PSC 2 Input B Control" name="PFRC2B" offset="0xFD" size="1">
                    <bitfield caption="PSC 2 Capture Enable Input Part B" mask="0x80" name="PCAE2B"/>
                    <bitfield caption="PSC 2 Input Select for Part B" mask="0x40" name="PISEL2B"/>
                    <bitfield caption="PSC 2 Edge Level Selector on Input Part B" mask="0x20" name="PELEV2B"/>
                    <bitfield caption="PSC 2 Filter Enable on Input Part B" mask="0x10" name="PFLTE2B"/>
                    <bitfield caption="PSC 2 Retrigger and Fault Mode for Part B" mask="0x0F" name="PRFM2B"
                              values="PSC_FAULT_MODE_OPER"/>
                </register>
                <register caption="PSC 2 Input B Control" name="PFRC2A" offset="0xFC" size="1">
                    <bitfield caption="PSC 2 Capture Enable Input Part A" mask="0x80" name="PCAE2A"/>
                    <bitfield caption="PSC 2 Input Select for Part A" mask="0x40" name="PISEL2A"/>
                    <bitfield caption="PSC 2 Edge Level Selector on Input Part A" mask="0x20" name="PELEV2A"/>
                    <bitfield caption="PSC 2 Filter Enable on Input Part A" mask="0x10" name="PFLTE2A"/>
                    <bitfield caption="PSC 2 Retrigger and Fault Mode for Part A" mask="0x0F" name="PRFM2A"
                              values="PSC_FAULT_MODE_OPER"/>
                </register>
                <register caption="PSC 2 Control Register" name="PCTL2" offset="0xFB" size="1">
                    <bitfield caption="PSC 2 Prescaler Selects" mask="0xC0" name="PPRE2" values="PSC_PRESCALER"/>
                    <bitfield caption="Balance Flank Width Modulation" mask="0x20" name="PBFM2"/>
                    <bitfield caption="PSC 2 Asynchronous Output Control B" mask="0x10" name="PAOC2B"/>
                    <bitfield caption="PSC 2 Asynchronous Output Control A" mask="0x08" name="PAOC2A"/>
                    <bitfield caption="PSC2 Auto Run" mask="0x04" name="PARUN2"/>
                    <bitfield caption="PSC2 Complete Cycle" mask="0x02" name="PCCYC2"/>
                    <bitfield caption="PSC 2 Run" mask="0x01" name="PRUN2"/>
                </register>
                <register caption="PSC 2 Configuration Register" name="PCNF2" offset="0xFA" size="1">
                    <bitfield caption="PSC 2 Fifty" mask="0x80" name="PFIFTY2"/>
                    <bitfield caption="PSC 2 Autolock" mask="0x40" name="PALOCK2"/>
                    <bitfield caption="PSC 2 Lock" mask="0x20" name="PLOCK2"/>
                    <bitfield caption="PSC 2 Mode" mask="0x18" name="PMODE2" values="PSC_ALIGN_MODE"/>
                    <bitfield caption="PSC 2 Output Polarity" mask="0x04" name="POP2"/>
                    <bitfield caption="PSC 2 Input Clock Select" mask="0x02" name="PCLKSEL2"/>
                    <bitfield caption="PSC 2 Output Matrix Enable" mask="0x01" name="POME2"/>
                </register>
                <register caption="Output Compare RB Register " name="OCR2RB" offset="0xF8" size="2" mask="0xFFFF"/>
                <register caption="Output Compare SB Register " name="OCR2SB" offset="0xF6" size="2" mask="0x0FFF"/>
                <register caption="Output Compare RA Register " name="OCR2RA" offset="0xF4" size="2" mask="0x0FFF"/>
                <register caption="Output Compare SA Register " name="OCR2SA" offset="0xF2" size="2" mask="0x0FFF"/>
                <register caption="PSC 2 Output Matrix" name="POM2" offset="0xF1" size="1">
                    <bitfield caption="Output Matrix Output B Ramps" mask="0xF0" name="POMV2B"/>
                    <bitfield caption="Output Matrix Output A Ramps" mask="0x0F" name="POMV2A"/>
                </register>
                <register caption="PSC2 Synchro and Output Configuration" name="PSOC2" offset="0xF0" size="1">
                    <bitfield caption="PSC 2 Output 23 Select" mask="0xC0" name="POS2" lsb="2"/>
                    <bitfield caption="Synchronization Out for ADC Selection" mask="0x30" name="PSYNC2"/>
                    <bitfield caption="PSCOUT23 Output Enable" mask="0x08" name="POEN2D"/>
                    <bitfield caption="PSCOUT21 Output Enable" mask="0x04" name="POEN2B"/>
                    <bitfield caption="PSCOUT22 Output Enable" mask="0x02" name="POEN2C"/>
                    <bitfield caption="PSCOUT20 Output Enable" mask="0x01" name="POEN2A"/>
                </register>
                <register caption="PSC2 Interrupt Mask Register" name="PIM2" offset="0xA5" size="1">
                    <bitfield caption="PSC 2 Synchro Error Interrupt Enable" mask="0x20" name="PSEIE2"/>
                    <bitfield caption="External Event B Interrupt Enable" mask="0x10" name="PEVE2B"/>
                    <bitfield caption="External Event A Interrupt Enable" mask="0x08" name="PEVE2A"/>
                    <bitfield caption="End of Cycle Interrupt Enable" mask="0x01" name="PEOPE2"/>
                </register>
                <register caption="PSC2 Interrupt Flag Register" name="PIFR2" offset="0xA4" size="1">
                    <bitfield caption="PSC 2 Synchro Error Interrupt" mask="0x20" name="PSEI2"/>
                    <bitfield caption="External Event B Interrupt" mask="0x10" name="PEV2B"/>
                    <bitfield caption="External Event A Interrupt" mask="0x08" name="PEV2A"/>
                    <bitfield caption="Ramp Number" mask="0x06" name="PRN2" values="MISC_2BIT_COUNT"/>
                    <bitfield caption="End of PSC2 Interrupt" mask="0x01" name="PEOP2"/>
                </register>
            </register-group>
            <register-group caption="Power Stage Controller" name="PSC1">
                <register caption="PSC 1 Input Capture Register " name="PICR1" offset="0xEE" size="2" mask="0x0FFF"/>
                <register caption="PSC 1 Input B Control" name="PFRC1B" offset="0xED" size="1">
                    <bitfield caption="PSC 1 Capture Enable Input Part B" mask="0x80" name="PCAE1B"/>
                    <bitfield caption="PSC 1 Input Select for Part B" mask="0x40" name="PISEL1B"/>
                    <bitfield caption="PSC 1 Edge Level Selector on Input Part B" mask="0x20" name="PELEV1B"/>
                    <bitfield caption="PSC 1 Filter Enable on Input Part B" mask="0x10" name="PFLTE1B"/>
                    <bitfield caption="PSC 1 Retrigger and Fault Mode for Part B" mask="0x0F" name="PRFM1B"
                              values="PSC_FAULT_MODE_OPER"/>
                </register>
