bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90PWM1.xml
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSRSYNC"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog-to-Digital Converter" name="ADC">
            <register-group caption="Analog-to-Digital Converter" name="ADC">
                <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
                    <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF2"/>
                    <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
                    <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x0F" name="MUX"/>
                </register>
                <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x7A" size="1" ocd-rw="R">
                    <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
                    <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
                    <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
                    <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
                    <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
                    <bitfield caption="ADC  Prescaler Select Bits" mask="0x07" name="ADPS"/>
                </register>
                <register caption="ADC Data Register  Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1" mask="0x9F">
                    <bitfield caption="ADC High Speed Mode" mask="0x80" name="ADHSM"/>
                    <bitfield caption="ADC Start Conversion" mask="0x10" name="ADASCR"/>
                    <bitfield caption="ADC Auto Trigger Source Selection 3" mask="0x08" name="ADTS3"/>
                    <bitfield caption="ADC Auto Trigger Source Selection 2" mask="0x04" name="ADTS2"/>
                    <bitfield caption="ADC Auto Trigger Source Selection 1" mask="0x02" name="ADTS1"/>
                    <bitfield caption="ADC Auto Trigger Source Selection 0" mask="0x01" name="ADTS0"/>
                </register>
                <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
                    <bitfield caption="" mask="0x80" name="ADC7D"/>
                    <bitfield caption="" mask="0x40" name="ADC6D"/>
                    <bitfield caption="" mask="0x20" name="ADC5D"/>
                    <bitfield caption="" mask="0x10" name="ADC4D"/>
                    <bitfield caption="" mask="0x08" name="ADC3D"/>
                    <bitfield caption="" mask="0x04" name="ADC2D"/>
                    <bitfield caption="" mask="0x02" name="ADC1D"/>
                    <bitfield caption="" mask="0x01" name="ADC0D"/>
                </register>
                <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="" mask="0x20" name="ACMP0D"/>
                    <bitfield caption="" mask="0x10" name="AMP0PD"/>
                    <bitfield caption="" mask="0x08" name="AMP0ND"/>
                    <bitfield caption="" mask="0x04" name="ADC10D"/>
                    <bitfield caption="" mask="0x02" name="ADC9D"/>
                    <bitfield caption="" mask="0x01" name="ADC8D"/>
                </register>
                <register caption="" name="AMP0CSR" offset="0x76" size="1">
                    <bitfield caption="" mask="0x80" name="AMP0EN"/>
                    <bitfield caption="" mask="0x40" name="AMP0IS"/>
                    <bitfield caption="" mask="0x30" name="AMP0G"/>
                    <bitfield caption="" mask="0x03" name="AMP0TS"/>
                </register>
                <register caption="" name="AMP1CSR" offset="0x77" size="1">
                    <bitfield caption="" mask="0x80" name="AMP1EN"/>
                    <bitfield caption="" mask="0x40" name="AMP1IS"/>
                    <bitfield caption="" mask="0x30" name="AMP1G"/>
                    <bitfield caption="" mask="0x03" name="AMP1TS"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_V_REF2">
                <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
                <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
                <value caption="Reserved" name="VAL_0x02" value="0x02"/>
                <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03"
                       value="0x03"/>
            </value-group>
        </module>
        <module caption="Serial Peripheral Interface" name="SPI">
            <register-group caption="Serial Peripheral Interface" name="SPI">
                <register caption="SPI Control Register" name="SPCR" offset="0x4C" size="1">
                    <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
                    <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
                    <bitfield caption="Data Order" mask="0x20" name="DORD"/>
                    <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
                    <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
                    <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
                    <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
                </register>
                <register caption="SPI Status Register" name="SPSR" offset="0x4D" size="1" ocd-rw="R">
                    <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
                    <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
                    <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
                </register>
                <register caption="SPI Data Register" name="SPDR" offset="0x4E" size="1" ocd-rw="">
                    <bitfield caption="SPI Data" mask="0xFF" name="SPD"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_SCK_RATE_3BIT">
                <value caption="fosc/4" name="VAL_0x00" value="0x00"/>
                <value caption="fosc/16" name="VAL_0x01" value="0x01"/>
                <value caption="fosc/64" name="VAL_0x02" value="0x02"/>
                <value caption="fosc/128" name="VAL_0x03" value="0x03"/>
                <value caption="fosc/2" name="VAL_0x04" value="0x04"/>
                <value caption="fosc/8" name="VAL_0x05" value="0x05"/>
                <value caption="fosc/32" name="VAL_0x06" value="0x06"/>
                <value caption="fosc/64" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
