bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90PWM1.xml
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control Register" name="WDTCSR" offset="0x60" size="1" ocd-rw="R">
                    <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
                    <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
                    <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP"
                              values="WDOG_TIMER_PRESCALE_4BITS"/>
                    <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                </register>
            </register-group>
            <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
                <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
            </value-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0xC0" name="ISC3"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0x30" name="ISC2"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0x0C" name="ISC1"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0x03" name="ISC0"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
                    <bitfield caption="External Interrupt Mask" mask="0x0F" name="INT"/>
                </register>
                <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
                    <bitfield caption="External Interrupt Flags" mask="0x0F" name="INTF"/>
                </register>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="EEPROM" name="EEPROM">
            <register-group caption="EEPROM" name="EEPROM">
                <register caption="EEPROM Read/Write Access Bytes" name="EEAR" offset="0x41" size="2" mask="0x0FFF">
                    <bitfield caption="EEPROM Address bytes" mask="0x0FFF" name="EEAR"/>
                </register>
                <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1">
                    <bitfield caption="EEPROM Data Bits" mask="0xFF" name="EEDR"/>
                </register>
                <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
                    <bitfield caption="EEPROM Programming Mode" mask="0x30" name="EEPM"/>
                    <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
                    <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMWE"/>
                    <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEWE"/>
                    <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
                </register>
            </register-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="Analog Comparator 0 Control Register" name="AC0CON" offset="0xAD" size="1">
                    <bitfield caption="Analog Comparator 0 Enable Bit" mask="0x80" name="AC0EN"/>
                    <bitfield caption="Analog Comparator 0 Interrupt Enable Bit" mask="0x40" name="AC0IE"/>
                    <bitfield caption="Analog Comparator 0  Interrupt Select Bit" mask="0x30" name="AC0IS"/>
                    <bitfield caption="Analog Comparator 0 Multiplexer Register" mask="0x07" name="AC0M"/>
                </register>
                <register caption="Analog Comparator 2 Control Register" name="AC2CON" offset="0xAF" size="1">
                    <bitfield caption="Analog Comparator 2 Enable Bit" mask="0x80" name="AC2EN"/>
                    <bitfield caption="Analog Comparator 2 Interrupt Enable Bit" mask="0x40" name="AC2IE"/>
                    <bitfield caption="Analog Comparator 2  Interrupt Select Bit" mask="0x30" name="AC2IS"
                              values="ANALOG_COMP_INTERRUPT"/>
                    <bitfield caption="Analog Comparator 2 Multiplexer Register" mask="0x07" name="AC2M"/>
                </register>
                <register caption="Analog Comparator Status Register" name="ACSR" offset="0x50" size="1" ocd-rw="R">
                    <bitfield caption="Analog Comparator Clock Divider" mask="0x80" name="ACCKDIV"/>
                    <bitfield caption="Analog Comparator 2 Interrupt Flag Bit" mask="0x40" name="AC2IF"/>
                    <bitfield caption="Analog Comparator 1  Interrupt Flag Bit" mask="0x20" name="AC1IF"/>
                    <bitfield caption="Analog Comparator 0 Interrupt Flag Bit" mask="0x10" name="AC0IF"/>
                    <bitfield caption="Analog Comparator 2 Output Bit" mask="0x04" name="AC2O"/>
                    <bitfield caption="Analog Comparator 1 Output Bit" mask="0x02" name="AC1O"/>
                    <bitfield caption="Analog Comparator 0 Output Bit" mask="0x01" name="AC0O"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="SOIC24">
            <pin pad="PD0" position="1"/>
            <pin pad="PE0" position="2"/>
            <pin pad="PD1" position="3"/>
            <pin pad="PD2" position="4"/>
            <pin pad="PD3" position="5"/>
            <pin pad="VCC" position="6"/>
            <pin pad="GND" position="7"/>
            <pin pad="PB0" position="8"/>
            <pin pad="PB1" position="9"/>
            <pin pad="PE1" position="10"/>
            <pin pad="PE2" position="11"/>
            <pin pad="PD4" position="12"/>
            <pin pad="PD5" position="13"/>
            <pin pad="PD6" position="14"/>
            <pin pad="PD7" position="15"/>
            <pin pad="PB2" position="16"/>
            <pin pad="AVCC" position="17"/>
            <pin pad="AGND" position="18"/>
            <pin pad="AREF" position="19"/>
            <pin pad="PB3" position="20"/>
            <pin pad="PB4" position="21"/>
            <pin pad="PB5" position="22"/>
            <pin pad="PB6" position="23"/>
            <pin pad="PB7" position="24"/>
        </pinout>
        <pinout name="QFN32">
            <pin pad="PD2" position="1"/>
            <pin pad="PD3" position="2"/>
            <pin pad="NC" position="3"/>
            <pin pad="VCC" position="4"/>
            <pin pad="GND" position="5"/>
            <pin pad="NC" position="6"/>
            <pin pad="NC" position="7"/>
            <pin pad="PB0" position="8"/>
            <pin pad="PB1" position="9"/>
            <pin pad="PE1" position="10"/>
            <pin pad="PE2" position="11"/>
            <pin pad="PD4" position="12"/>
            <pin pad="PD5" position="13"/>
            <pin pad="PD6" position="14"/>
            <pin pad="PD7" position="15"/>
            <pin pad="PB2" position="16"/>
            <pin pad="NC" position="17"/>
            <pin pad="NC" position="18"/>
            <pin pad="AVCC" position="19"/>
            <pin pad="AGND" position="20"/>
            <pin pad="AREF" position="21"/>
            <pin pad="NC" position="22"/>
            <pin pad="PB3" position="23"/>
            <pin pad="PB4" position="24"/>
            <pin pad="NC" position="25"/>
            <pin pad="PB5" position="26"/>
            <pin pad="PB6" position="27"/>
            <pin pad="PB7" position="28"/>
            <pin pad="PD0" position="29"/>
            <pin pad="NC" position="30"/>
            <pin pad="PE0" position="31"/>
            <pin pad="PD1" position="32"/>
        </pinout>
    </pinouts>
</target-description-file>
